Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.52/svd/ATSAMR34J18B.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH5_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH6_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x42001800</baseAddress>
         <interrupt>
            <name>TCC1</name>
            <value>15</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x42001C00</baseAddress>
         <interrupt>
            <name>TCC2</name>
            <value>16</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TRNG</name>
         <version>U22421.0.0</version>
         <description>True Random Generator</description>
         <groupName>TRNG</groupName>
         <prependToName>TRNG_</prependToName>
         <baseAddress>0x42003800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TRNG</name>
            <value>27</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDYEO</name>
                     <description>Data Ready Event Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATA</name>
               <description>Output Data</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
